StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730a/core/rtw_rm_fsm.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/

#include <drv_types.h>
#include <hal_data.h>
#ifdef CONFIG_RTW_80211K
#include "rtw_rm_fsm.h"
#include "rtw_rm_util.h"

struct fsm_state {
	u8 *name;
	int(*fsm_func)(struct rm_obj *prm, enum RM_EV_ID evid);
};

static void rm_state_initial(struct rm_obj *prm);
static void rm_state_goto(struct rm_obj *prm, enum RM_STATE rm_state);
static void rm_state_run(struct rm_obj *prm, enum RM_EV_ID evid);
static struct rm_event *rm_dequeue_ev(_queue *queue);
static struct rm_obj *rm_dequeue_rm(_queue *queue);

void rm_timer_callback(void *data)
{
	int i;
	_adapter *padapter = (_adapter *)data;
	struct rm_priv *prmpriv = &padapter->rmpriv;
	struct rm_clock *pclock;


	/* deal with clock */
	for (i = 0; i < RM_TIMER_NUM; i++) {
		pclock = &prmpriv->clock[i];
		if (pclock->prm == NULL
		    || (ATOMIC_READ(&(pclock->counter)) == 0)) {
			continue;
		}

		ATOMIC_DEC(&(pclock->counter));

		if (ATOMIC_READ(&(pclock->counter)) == 0)
			rm_post_event(pclock->prm->psta->padapter,
				      pclock->prm->rmid, prmpriv->clock[i].evid);
	}
	_set_timer(&prmpriv->rm_timer, CLOCK_UNIT);
}

int rtw_init_rm(_adapter *padapter)
{
	struct rm_priv *prmpriv = &padapter->rmpriv;


	RTW_INFO("RM: %s\n", __func__);
	_rtw_init_queue(&(prmpriv->rm_queue));
	_rtw_init_queue(&(prmpriv->ev_queue));

	/* bit 0-7 */
	prmpriv->rm_en_cap_def[0] = 0
				    | BIT(RM_LINK_MEAS_CAP_EN)
				    | BIT(RM_NB_REP_CAP_EN)
				    /*| BIT(RM_PARAL_MEAS_CAP_EN)*/
				    | BIT(RM_REPEAT_MEAS_CAP_EN)
				    | BIT(RM_BCN_PASSIVE_MEAS_CAP_EN)
				    | BIT(RM_BCN_ACTIVE_MEAS_CAP_EN)
				    | BIT(RM_BCN_TABLE_MEAS_CAP_EN)
				    /*| BIT(RM_BCN_MEAS_REP_COND_CAP_EN)*/;

	/* bit  8-15 */
	prmpriv->rm_en_cap_def[1] = 0
				    /*| BIT(RM_FRAME_MEAS_CAP_EN - 8)*/
#ifdef CONFIG_RTW_ACS
				    | BIT(RM_CH_LOAD_CAP_EN - 8)
				    | BIT(RM_NOISE_HISTO_CAP_EN - 8)
#endif
				    /*| BIT(RM_STATIS_MEAS_CAP_EN - 8)*/
				    /*| BIT(RM_LCI_MEAS_CAP_EN - 8)*/
				    /*| BIT(RM_LCI_AMIMUTH_CAP_EN - 8)*/
				    /*| BIT(RM_TRANS_STREAM_CAT_MEAS_CAP_EN - 8)*/
				    /*| BIT(RM_TRIG_TRANS_STREAM_CAT_MEAS_CAP_EN - 8)*/;

	/* bit 16-23 */
	prmpriv->rm_en_cap_def[2] = 0
				    /*| BIT(RM_AP_CH_REP_CAP_EN - 16)*/
				    /*| BIT(RM_RM_MIB_CAP_EN - 16)*/
				    /*| BIT(RM_OP_CH_MAX_MEAS_DUR0 - 16)*/
				    /*| BIT(RM_OP_CH_MAX_MEAS_DUR1 - 16)*/
				    /*| BIT(RM_OP_CH_MAX_MEAS_DUR2 - 16)*/
				    /*| BIT(RM_NONOP_CH_MAX_MEAS_DUR0 - 16)*/
				    /*| BIT(RM_NONOP_CH_MAX_MEAS_DUR1 - 16)*/
				    /*| BIT(RM_NONOP_CH_MAX_MEAS_DUR2 - 16)*/;

	/* bit 24-31 */
	prmpriv->rm_en_cap_def[3] = 0
				    /*| BIT(RM_MEAS_PILOT_CAP0 - 24)*/
				    /*| BIT(RM_MEAS_PILOT_CAP1 - 24)*/
				    /*| BIT(RM_MEAS_PILOT_CAP2 - 24)*/
				    /*| BIT(RM_MEAS_PILOT_TRANS_INFO_CAP_EN - 24)*/
				    /*| BIT(RM_NB_REP_TSF_OFFSET_CAP_EN - 24)*/
				    | BIT(RM_RCPI_MEAS_CAP_EN - 24)
				    | BIT(RM_RSNI_MEAS_CAP_EN - 24)
				    /*| BIT(RM_BSS_AVG_ACCESS_DELAY_CAP_EN - 24)*/;

	/* bit 32-39 */
	prmpriv->rm_en_cap_def[4] = 0
				    /*| BIT(RM_BSS_AVG_ACCESS_DELAY_CAP_EN - 32)*/
				    /*| BIT(RM_AVALB_ADMIS_CAPACITY_CAP_EN - 32)*/
				    /*| BIT(RM_ANT_CAP_EN - 32)*/;

	prmpriv->enable = _TRUE;

	/* clock timer */
	rtw_init_timer(&prmpriv->rm_timer,
		       padapter, rm_timer_callback, padapter);
	_set_timer(&prmpriv->rm_timer, CLOCK_UNIT);

	prmpriv->meas_token = 1;
	return _SUCCESS;
}

int rtw_deinit_rm(_adapter *padapter)
{
	struct rm_priv *prmpriv = &padapter->rmpriv;
	struct rm_obj *prm;
	struct rm_event *pev;


	RTW_INFO("RM: %s\n", __func__);
	prmpriv->enable = _FALSE;
	_cancel_timer_ex(&prmpriv->rm_timer);

	/* free all events and measurements */
	while ((pev = rm_dequeue_ev(&prmpriv->ev_queue)) != NULL) {
		rtw_mfree((void *)pev, sizeof(struct rm_event));
	}

	while ((prm = rm_dequeue_rm(&prmpriv->rm_queue)) != NULL) {
		rm_state_run(prm, RM_EV_cancel);
	}

	_rtw_deinit_queue(&(prmpriv->rm_queue));
	_rtw_deinit_queue(&(prmpriv->ev_queue));

	return _SUCCESS;
}

int rtw_free_rm_priv(_adapter *padapter)
{
	return rtw_deinit_rm(padapter);
}

static int rm_enqueue_ev(_queue *queue, struct rm_event *obj, bool to_head)
{
	_irqL irqL;


	if (obj == NULL) {
		return _FAIL;
	}

	_enter_critical(&queue->lock, &irqL);

	if (to_head) {
		rtw_list_insert_head(&obj->list, &queue->queue);
	} else {
		rtw_list_insert_tail(&obj->list, &queue->queue);
	}

	_exit_critical(&queue->lock, &irqL);

	return _SUCCESS;
}

static void rm_set_clock(struct rm_obj *prm, u32 ms, enum RM_EV_ID evid)
{
	ATOMIC_SET(&(prm->pclock->counter), (ms / CLOCK_UNIT));
	prm->pclock->evid = evid;
}

static struct rm_clock *rm_alloc_clock(_adapter *padapter, struct rm_obj *prm)
{
	int i;
	struct rm_priv *prmpriv = &padapter->rmpriv;
	struct rm_clock *pclock = NULL;


	for (i = 0; i < RM_TIMER_NUM; i++) {
		pclock = &prmpriv->clock[i];

		if (pclock->prm == NULL) {
			pclock->prm = prm;
			ATOMIC_SET(&(pclock->counter), 0);
			pclock->evid = RM_EV_max;
			break;
		}
	}
	return pclock;
}

static void rm_cancel_clock(struct rm_obj *prm)
{
	ATOMIC_SET(&(prm->pclock->counter), 0);
	prm->pclock->evid = RM_EV_max;
}

static void rm_free_clock(struct rm_clock *pclock)
{
	pclock->prm = NULL;
	ATOMIC_SET(&(pclock->counter), 0);
	pclock->evid = RM_EV_max;
}

static int is_list_linked(const struct list_head *head)
{
	return head->prev != NULL;
}

void rm_free_rmobj(struct rm_obj *prm)
{
	if (is_list_linked(&prm->list)) {
		rtw_list_delete(&prm->list);
	}

